snlkuharlocal/src/DataProcessors/ПроверкаКарточекДляНК/ПроверкаКарточекДляНК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПроверкаКарточекДляНК</name>
  <attributes>
    <name>ТД_Результат</name>
    <type>
      <types>SpreadsheetDocument</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ошибки</name>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Ошибка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/КатегорииОбъектов/КатегорииОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КатегорииОбъектов</name>
  <comment>(Общ)</comment>
  <dimensions>
    <name>Объект</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КатегорииОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/СтатусыНоменклатуры_ЧЗ/СтатусыНоменклатуры_ЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыНоменклатуры_ЧЗ</name>
  <comment>Статусы карточек номенклатуры в ЧЗ</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКарточкиНоменклатурыВЧЗ</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ВидыКомплектов/ВидыКомплектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКомплектов</name>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Ассортито</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>ГотовыйКомплект</name>
  </enumValues>
  <enumValues>
    <name>АссортитоКомплектов</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыКарточкиНоменклатурыВЧЗ/СтатусыКарточкиНоменклатурыВЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКарточкиНоменклатурыВЧЗ</name>
  <enumValues>
    <name>НеПодлежитМаркировке</name>
  </enumValues>
  <enumValues>
    <name>КОтправкевНК</name>
  </enumValues>
  <enumValues>
    <name>НеСоздана</name>
  </enumValues>
  <enumValues>
    <name>Создана</name>
  </enumValues>
  <enumValues>
    <name>НаМодерации</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПодписания</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Опубликована</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/DataProcessors/ПроверкаКарточекДляНК/ObjectModule.bsl
Перем ДанныеРасшифровки Экспорт;

Функция ВывестиСхемуВТД(СК, ИмяНастройки = Неопределено, ПараметрыДанных = Неопределено, ДопПараметры = Неопределено) Экспорт 
	
	Отбор 			= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Отбор",			Новый Структура);
	ВнешниеДанные	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ВнешниеДанные", Новый Структура);	
	МВТ				= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "МВТ",			Новый МенеджерВременныхТаблиц);	
	Адрес			= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Адрес", "");	
	ТД				= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ТД_Результат", Новый ТабличныйДокумент);
	
	КМ = Новый КомпоновщикМакетаКомпоновкиДанных;	
	
	КН				= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "КомпоновщикНастроек");
	
	Если КН = Неопределено Тогда
		КН = Новый КомпоновщикНастроекКомпоновкиДанных;
		КН.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СК));
			
		Если ИмяНастройки = Неопределено Тогда
			КН.ЗагрузитьНастройки(СК.НастройкиПоУмолчанию);
		Иначе
			КН.ЗагрузитьНастройки(СК.ВариантыНастроек[ИмяНастройки].Настройки);	
		КонецЕсли; 
		
		КН.Настройки.Отбор.Элементы.Очистить();
		Если Отбор<>Неопределено Тогда
			Для Каждого Элемент_Отбора Из Отбор Цикл
				ДобавитьПолеОтбора(КН, Элемент_Отбора);		
			КонецЦикла; 
		КонецЕсли;	
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыДанных)=Тип("Структура") Тогда
		Для Каждого Элемент Из ПараметрыДанных Цикл
			Параметр=КН.Настройки.ПараметрыДанных.Элементы.Найти(Элемент.Ключ);
			Если Параметр<>Неопределено Тогда
				Параметр.Использование	=Истина;
				Параметр.Значение		=Элемент.Значение;			
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;
	
	ЗаголовкиПолей	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ЗаголовкиПолей");
	Если ЗаголовкиПолей<>Неопределено Тогда
		УстановитьЗаголовки(КН.Настройки.Выбор.Элементы, ЗаголовкиПолей);		 	
	КонецЕсли; 
	
	ДР	= Неопределено;
	КМ	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МК	= КМ.Выполнить(СК,КН.Настройки, ДР,,Тип("ГенераторМакетаКомпоновкиДанных"));
	
	ПВ	= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
	ПВ.УстановитьДокумент(ТД);
	
	ПК	= Новый ПроцессорКомпоновкиДанных;
	
	ПК.Инициализировать(МК, ВнешниеДанные, ДР, Истина, Ложь, МВТ);
	
	ТД						= ПВ.Вывести(ПК);
	ТД.ОтображатьСетку		= Ложь;
	ТД.ОтображатьЗаголовки	= Ложь;
	АдресРасшифровки		= ПоместитьВоВременноеХранилище(ДР,Адрес);
	
	Результат				= Новый Структура("ТД,АдресРасшифровки", ТД, АдресРасшифровки);
	
	ДанныеРасшифровки		= ДР;
	
	Возврат Результат;	
КонецФункции //ВывестиСхемуВТЗ(СК,ПараметрыДанных=Неопределено)

Процедура ДобавитьПолеОтбора(КН,Элемент_Отбора)	
	Если КН.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(Элемент_Отбора.Ключ))=Неопределено Тогда Возврат КонецЕсли;
	
	Элемент_Пол=КН.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент_Пол.ЛевоеЗначение	=Новый ПолеКомпоновкиДанных(Элемент_Отбора.Ключ);
	Элемент_Пол.ВидСравнения	=ВидСравненияКомпоновкиДанных.ВИерархии;
	Элемент_Пол.ПравоеЗначение	=Элемент_Отбора.Значение;	
КонецПроцедуры

Процедура УстановитьЗаголовки(Поля,Заголовки)
	Для Каждого ЭлементЗаголовка Из Заголовки Цикл
		Для Каждого Поле Из Поля Цикл
			Если ВРег(Поле.Заголовок)=ВРег(ЭлементЗаголовка.Ключ) 
				ИЛИ ВРег(Поле.Поле)=ВРег(ЭлементЗаголовка.Ключ) Тогда
				Поле.Заголовок=ЭлементЗаголовка.Значение;				
			КонецЕсли;
			Если ТипЗнч(Поле)=Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
				УстановитьЗаголовки(Поле.Элементы,Заголовки);									
			КонецЕсли; 
		КонецЦикла;			
	КонецЦикла;
КонецПроцедуры

Функция ПроверитьДанныеТоваровДляМаркировки(ДокСсылка, мНоменклатура = Неопределено, ПроверятьСтатус = Ложь) Экспорт	
	тОшибки = Новый ТаблицаЗначений;
	тОшибки.Колонки.Добавить("Модель");
	тОшибки.Колонки.Добавить("Номенклатура");	
	тОшибки.Колонки.Добавить("Ошибка");
	
	Если мНоменклатура = Неопределено Тогда
		Ссылки = МаркировкаС.ПолучитьНоменклатуруДокумента(ДокСсылка);		
	Иначе
		Если ТипЗнч(мНоменклатура) = Тип("Массив") Тогда
			Ссылки = мНоменклатура;			
		Иначе
			Ссылки = Новый Массив;
			Если ЗначениеЗаполнено(мНоменклатура) И ТипЗнч(мНоменклатура) = Тип("СправочникСсылка.Номенклатура") Тогда		
				Ссылки.Добавить(мНоменклатура);
			КонецЕсли;		
		КонецЕсли; 		
	КонецЕсли;	
	
	Если Ссылки.Количество() = 0 Тогда
		Возврат тОшибки;
	КонецЕсли; 
	
	Запрос	= Новый ("Запрос");
	Запрос.Текст = "
	|ВЫБРАТЬ 
	|	Родитель		КАК Модель,	
	|	Ссылка			КАК Номенклатура,
	|	ВидКомплекта	КАК ВидКомплекта	
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Справочник.Номенклатура
	|ГДЕ
	|	Ссылка В (&Ссылки)
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Модель,
	|	МАКСИМУМ(Категория) КАК Категория
	|ПОМЕСТИТЬ ВТ_Категории
	|ИЗ
	|	ВТ_Товары
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.КатегорииОбъектов КАК Категории
	|ПО
	|	Категории.Объект = ВТ_Товары.Модель			
	|СГРУППИРОВАТЬ ПО
	|	Модель
	|ИНДЕКСИРОВАТЬ ПО
	|	Модель
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Товары.Модель					КАК Модель,	
	|	ВТ_Товары.Модель.ФР_Бренд			КАК Бренд,
	
	//Кухарь А.Ю.  16.03.2026 начало   
	//MARK-3537
	// 	|	ВТ_Товары.Модель.КодПроизводителя 	КАК КодПроизводителя,   
	|	ВТ_Товары.Модель.АртикулЧЗ 	КАК КодПроизводителя,    
	//Кухарь А.Ю.  16.03.2026 конец
	
	|	ВТ_Товары.Модель.ШтукВКоробке		КАК ШтукВКоробке,	
	|	ВТ_Товары.Модель.ВидНоменклатурыЧЗ	КАК ВидНоменклатурыЧЗ,
	|
	|	ВТ_Категории.Категория				КАК Категория,
	|
	|	Состав.МатериалСостав				КАК Материал,
	|	Состав.МатериалСостав.Код			КАК Материал_Код
	|ИЗ
	|	ВТ_Товары	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.Номенклатура.СоставНоменклатуры КАК Состав
	|ПО
	|	Состав.Ссылка = ВТ_Товары.Модель
	|	И Состав.МатериалСостав.МатериалЧЗ.ВерсияДанных ЕСТЬ NULL
	|	И Состав.Процент>0
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТ_Категории
	|ПО
	|	ВТ_Категории.Модель = ВТ_Товары.Модель	
	|ИТОГИ МАКСИМУМ(Категория) ПО
	|	Модель
	|;	
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура.Родитель					КАК Модель,	
	|	ВТ_Товары.Номенклатура							КАК Номенклатура,
	|	ВТ_Товары.Номенклатура.Цвет						КАК Цвет,
	|	ВТ_Товары.Номенклатура.Цвет.ОсновнойЦвет		КАК ОсновнойЦвет,
	//++Данилова Е.В. 03.07.2026 Изм.№0000000172
	//|	ВТ_Товары.Номенклатура.Цвет.ОсновнойЦвет.ЦветЧЗ КАК ЦветЧЗ,
	|ВТ_Товары.Номенклатура.Цвет.ЦветЧЗ 				КАК ЦветЧЗ,
	//--Данилова Е.В. 03.07.2026 
	|	ВТ_Товары.Номенклатура.РазмерДляСайта			КАК РазмерДляСайта,	
	|	ВТ_Товары.Номенклатура.ГТИН						КАК ГТИН,
	|	ВТ_Товары.ВидКомплекта							КАК ВидКомплекта,
	|
	|	СтатусыНоменклатуры_ЧЗ.Статус					КАК Статус_ЧЗ,
	|	СтатусыНоменклатуры_ЧЗ_ЕЕ.Статус				КАК Статус_ЧЗ_ЕЕ
	|ИЗ
	|	ВТ_Товары	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтатусыНоменклатуры_ЧЗ.СрезПоследних(&ДатаСостояния,	
	|		Организация = &Организация	
	|		И Номенклатура В (ВЫБРАТЬ РАЗЛИЧНЫЕ Номенклатура ИЗ ВТ_Товары)
	|	) КАК СтатусыНоменклатуры_ЧЗ
	|ПО
	|	ВТ_Товары.Номенклатура = СтатусыНоменклатуры_ЧЗ.Номенклатура	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтатусыНоменклатуры_ЧЗ.СрезПоследних(&ДатаСостояния,
	|		(	
	|			Организация = &Организация_ЕЕ
	|			И ПОДСТРОКА(Номенклатура.ГТИН,1,3) = ""046""	
	|		)	
	|		И Номенклатура В (ВЫБРАТЬ РАЗЛИЧНЫЕ Номенклатура ИЗ ВТ_Товары)
	|	) КАК СтатусыНоменклатуры_ЧЗ_ЕЕ
	|ПО
	|	ВТ_Товары.Номенклатура = СтатусыНоменклатуры_ЧЗ_ЕЕ.Номенклатура	
	|";
	
	РеквДокумента	 = ПолучитьРеквизитыШапки(ДокСсылка, "Дата,Организация");
	
	Запрос.УстановитьПараметр("ДатаСостояния",	РеквДокумента.Дата);	
	Запрос.УстановитьПараметр("Организация",	РеквДокумента.Организация);
	Запрос.УстановитьПараметр("Организация_ЕЕ",	Маркировка_ПИ.ОрганизацияЕЕЭ());	
	Запрос.УстановитьПараметр("Ссылки",			Ссылки);	
	
	Результаты		= Запрос.ВыполнитьПакет();	
	
	//Модели
	Выборка_Модель	= Результаты[Результаты.ВГраница()-1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Модель");	
		
	Пока Выборка_Модель.Следующий() Цикл
		Модель = Выборка_Модель.Модель;
		тСвойства = Справочники.Номенклатура.ПолучитьЗначенияСвойствНК(Модель);			
		Для Каждого СтрокаТ Из тСвойства Цикл
			Если СтрокаТ.Обязательное И НЕ ЗначениеЗаполнено(СтрокаТ.Значение) Тогда				
				Ошибка = СтрШаблон("Не заполнено обязательное свойство: '%1'.", СтрокаТ.Свойство);
				ДобавитьОшибку(тОшибки, Модель, , Ошибка);
			КонецЕсли; 					
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(Выборка_Модель.Категория) Тогда
		    Ошибка = "Не заполнена категория.";
			ДобавитьОшибку(тОшибки, Модель, , Ошибка);
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(Выборка_Модель.Бренд) Тогда
		    Ошибка = "Не заполнен бренд.";
			ДобавитьОшибку(тОшибки, Модель, , Ошибка);		
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Выборка_Модель.ШтукВКоробке) Тогда
			Ошибка = "Не заполнено кол-во штук в коробке.";
			ДобавитьОшибку(тОшибки, Модель, , Ошибка);		
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(Выборка_Модель.ВидНоменклатурыЧЗ) Тогда
			Ошибка = "Не указан вид номенклатуры для ЧЗ.";
			ДобавитьОшибку(тОшибки, Модель, , Ошибка);
		КонецЕсли;		
		
		Выборка_Материал = Выборка_Модель.Выбрать();
		Пока Выборка_Материал.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка_Материал.Материал) Тогда			
				Ошибка = СтрШаблон("Не заполнен реквизит 'Материал ЧЗ'. Материал состава: '%1 (%2)'", Выборка_Материал.Материал, Выборка_Материал.Материал_Код);
				ДобавитьОшибку(тОшибки, Модель, , Ошибка);
			КонецЕсли;			
		КонецЦикла; 
	КонецЦикла; 
	
	//Номенклатура	
	Выборка_Номенклатура = Результаты[Результаты.ВГраница()].Выбрать();
	Пока Выборка_Номенклатура.Следующий() Цикл
		
		Модель		 = Выборка_Номенклатура.Модель;
		Номенклатура = Выборка_Номенклатура.Номенклатура;
		
		Если Выборка_Номенклатура.ВидКомплекта = Перечисления.ВидыКомплектов.Товар Тогда			
			ГТИН = СокрЛП(Выборка_Номенклатура.ГТИН);		
			Если СтрДлина(ГТИН)<>14 Тогда
				Ошибка = СтрШаблон("Не корректный GTIN: '%1'.", Выборка_Номенклатура.ГТИН);
				ДобавитьОшибку(тОшибки, Модель, Номенклатура, Ошибка);					
			Иначе			
				Если СтрНачинаетсяС(ГТИН, "2") ИЛИ СтрНачинаетсяС(ГТИН, "02") Тогда
					Ошибка = СтрШаблон("Не корректный GTIN: '%1'.", Выборка_Номенклатура.ГТИН);
					ДобавитьОшибку(тОшибки, Модель, Номенклатура, Ошибка);			
				КонецЕсли;
			КонецЕсли;		
			
			Если НЕ ЗначениеЗаполнено(Выборка_Номенклатура.Цвет) Тогда			
				ДобавитьОшибку(тОшибки, Модель, Номенклатура, "Не заполнен цвет.");					
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Выборка_Номенклатура.ОсновнойЦвет) Тогда			
				ДобавитьОшибку(тОшибки, Модель, Номенклатура, "Не заполнен основной цвет.");					
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Выборка_Номенклатура.ЦветЧЗ) Тогда			
				ДобавитьОшибку(тОшибки, Модель, Номенклатура, "Не заполнен цвет НК.");								
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Выборка_Номенклатура.РазмерДляСайта) Тогда			
				ДобавитьОшибку(тОшибки, Модель, Номенклатура, "Не заполнен размер для сайта.");					
			КонецЕсли;
			
		КонецЕсли;
	
		Если ПроверятьСтатус Тогда		
			ТекСтатус = Выборка_Номенклатура.Статус_ЧЗ_ЕЕ;
			Если ЗначениеЗаполнено(Выборка_Номенклатура.Статус_ЧЗ_ЕЕ) И СтатусДопустимДляЗакзаКодов(Выборка_Номенклатура.Статус_ЧЗ_ЕЕ) Тогда
				//
			Иначе
				ТекСтатус = Выборка_Номенклатура.Статус_ЧЗ;			
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекСтатус) Тогда                        
				Если СтатусДопустимДляЗакзаКодов(ТекСтатус) Тогда
				Иначе					
					ТекстОшибки = СтрШаблон("Не корректный статус карточки в ЧЗ: '%1', требуется: 'Опубликована'.", ТекСтатус);
					ДобавитьОшибку(тОшибки, Модель, Номенклатура, ТекстОшибки);										
				КонецЕсли;
			Иначе			
				ДобавитьОшибку(тОшибки, Модель, Номенклатура, "Не заполнен статус карточки ном. в ЧЗ.");			
			КонецЕсли;                
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат тОшибки;

КонецФункции // ()

Функция СтатусДопустимДляЗакзаКодов(СтатусНоменклатурыЧЗ)
	Возврат (СтатусНоменклатурыЧЗ = Перечисления.СтатусыКарточкиНоменклатурыВЧЗ.НаМодерации
		ИЛИ СтатусНоменклатурыЧЗ = Перечисления.СтатусыКарточкиНоменклатурыВЧЗ.Опубликована);
КонецФункции // ()
 

Функция ДобавитьОшибку(ТО, Модель, Номенклатура, Ошибка)
	СтрокаТ = ТО.Добавить();
	
	СтрокаТ.Модель 			= Модель;	
	СтрокаТ.Номенклатура	= Номенклатура;
	СтрокаТ.Ошибка		 	= Ошибка;

КонецФункции // ()
